4-AppRails/7-Blog/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    #mostrar todos los posts
    @posts = Post.all.order(created_at: :desc)

INSERT INTO "posts" ("title", "content", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @post = Post.create(title: params[:title], content: params[:content], image_url: params[:image_url])